# SQL Notes
### resource:https://www.w3schools.com/sql/default.asp

# select, *, count

In [ ]:
# use select to select column from tables, * means everything
select * from table_name

In [ ]:
#The SELECT DISTINCT statement is used to return only distinct (different) values.
#Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.
select distinct col_name from table_name

In [5]:
# The follwing sql count the distinct values in a col from a table
select count(distinct col_name) from table_name

# where,not,or,and

In [7]:
# Use where for condition select
# SELECT column1, column2, ...
# FROM table_name
# WHERE condition;
select * from Customers where Country='Mexico';

SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND/OR/NOT condition2 AND/OR/NOT condition3 ...;

In [ ]:
SELECT * FROM Customers WHERE Country='Germany' AND City='Berlin';
SELECT * FROM Customers WHERE City='Berlin' OR City='MÃ¼nchen';
SELECT * FROM Customers WHERE NOT Country='Germany';

# order by, insert, null

SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;

In [ ]:
SELECT * FROM Customers ORDER BY Country;
SELECT * FROM Customers ORDER BY Country, CustomerName;
SELECT * FROM Customers ORDER BY Country DESC;
SELECT * FROM Customers ORDER BY Country ASC, CustomerName DESC;

Specify both the column names and the values to be inserted:

In [ ]:
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);

If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:

In [ ]:
INSERT INTO table_name VALUES (value1, value2, value3, ...);

In [ ]:
INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway');

It is not possible to test for NULL values with comparison operators, such as =, <, or <>.
We will have to use the IS NULL and IS NOT NULL operators instead.

In [ ]:
SELECT column_names
FROM table_name
WHERE column_name IS NULL;

In [ ]:
SELECT column_names
FROM table_name
WHERE column_name IS NOT NULL;

# update, delete

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

In [ ]:
UPDATE Customers
SET ContactName='Juan'
WHERE Country='Mexico';

In [ ]:
# the following update all the contactName to 'Juan'
UPDATE Customers
SET ContactName='Juan';

The DELETE statement is used to delete existing records in a table.
It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:

In [ ]:
DELETE FROM table_name;

Delete based on condition:

In [ ]:
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';